const body2_data = {
    '第一週':{
        img:'./images/body2/img.png',
        title:'歷史之旅',
        text:'將任您欣賞和選購具有歷史價值和獨特風格的飾品，同時體驗城市的多樣性歷史文化',
        theme:'歷史之旅',
        date:'第一週112/11/3~11/5',
    },
    '3':{
        img:'./images/body2/img2.png',
        title:'歷史故事講述表演',
        text:'在這個主題週的舞台上，我們將有專業的故事講述者為您呈現城市的歷史故事<br>表演時間：<span class="color1 fw">晚上 7:00 - 9:00<span>',
        theme:'歷史之旅',
        date:'112/11/3(週五)'
    },
    '4':{
        img:'./images/body2/img2.png',
        title:'歷史故事講述表演',
        text:'在這個主題週的舞台上，我們將有專業的故事講述者為您呈現城市的歷史故事<br>表演時間：<span class="color1 fw"><span><span class="color1 fw">上午 10:00 - 上午12:00<span>',
        theme:'歷史之旅',
        date:'112/11/4(週六)'
    },
    '5':{
        img:'./images/body2/img2.png',
        title:'歷史故事講述表演',
        text:'在這個主題週的舞台上，我們將有專業的故事講述者為您呈現城市的歷史故事<br>表演時間：<span class="color1 fw">下午 2:00 - 下午4:00<span>',
        theme:'歷史之旅',
        date:'112/11/5(週日)'
    },
    '第二週':{
        img:'./images/body2/img3.png',
        title:'城市大自然',
        text:'設立專門的展覽攤位，展示各種多肉植物品種，從仙人掌到多肉盆栽，讓參與者可以購買或欣賞這些迷人的植物',
        theme:'城市大自然',
        date:'第二週112/11/10~11/12',
    },
    '10':{
        img:'./images/body2/img4.png',
        title:'本日無活動',
        text:'',
        theme:'城市大自然',
        date:'112/11/10(週五)'
    },
    '11':{
        img:'./images/body2/img4.png',
        title:'大自然音樂會',
        text:'歡迎來到「城市大自然」主題週！在我們的戶外舞台上，您將享受到大自然音樂會的精彩表演<br>表演時間：<span class="color1 fw">上午 11:00 - 下午1:00<span>',
        theme:'城市大自然',
        date:'112/11/11(週六)'
    },
    '12':{
        img:'./images/body2/img4.png',
        title:'大自然音樂會',
        text:'歡迎來到「城市大自然」主題週！在我們的戶外舞台上，您將享受到大自然音樂會的精彩表演<br>表演時間：<span class="color1 fw">下午 3:00 - 下午5:00<span>',
        theme:'城市大自然',
        date:'112/11/12(週日)'
    },
    '第三週':{
        img:'./images/body2/img5.png',
        title:'街頭藝術之旅',
        text:'邀請當地街頭藝術家主持工作坊，教授塗鴉、塗鴉藝術技巧、塗鴉藝術史等',
        theme:'街頭藝術之旅',
        date:'第三週112/11/17~11/19',
    },
    '17':{
        img:'./images/body2/img6.png',
        title:'街頭藝術表演',
        text:'來到「街頭藝術之旅」主題週，您將沉浸在一場驚艷的藝術盛會中！街頭藝術家們將在我們的舞台上進行現場表演，包括塗鴉、街舞和音樂演出<br>表演時間：<span class="color1 fw">晚上 8:00 - 10:00<span>',
        theme:'街頭藝術之旅',
        date:'112/11/17(週五)'
    },
    '18':{
        img:'./images/body2/img6.png',
        title:'街頭藝術表演',
        text:'來到「街頭藝術之旅」主題週，您將沉浸在一場驚艷的藝術盛會中！街頭藝術家們將在我們的舞台上進行現場表演，包括塗鴉、街舞和音樂演出<br>表演時間：<span class="color1 fw">下午 1:00 - 下午 3:00<span>',
        theme:'街頭藝術之旅',
        date:'112/11/18(週六)'
    },
    '19':{
        img:'./images/body2/img6.png',
        title:'街頭藝術表演',
        text:'來到「街頭藝術之旅」主題週，您將沉浸在一場驚艷的藝術盛會中！街頭藝術家們將在我們的舞台上進行現場表演，包括塗鴉、街舞和音樂演出<br>表演時間：<span class="color1 fw">上午 11:00 - 上午 1:00<span>',
        theme:'街頭藝術之旅',
        date:'112/11/19(週日)'
    },
    '第四週':{
        img:'./images/body2/img7.png',
        title:'多元文化探索',
        text:'本週主題區域強調多樣性、包容性和共融，為參與者提供一個了解和慶祝不同背景和觀點的機會',
        theme:'多元文化探索',
        date:'第四週112/11/24~11/26',
    },
    '24':{
        img:'./images/body2/img8.png',
        title:'多國舞蹈和音樂表演',
        text:'歡迎來到「多元文化探索」主題週！我們將為您呈現多國文化的舞蹈和音樂表演，展示不同國家的藝術風格<br>表演時間：<span class="color1 fw">晚上 7:30 - 9:30<span>',
        theme:'多元文化探索',
        date:'112/11/24(週五)'
    },
    '25':{
        img:'./images/body2/img8.png',
        title:'多國舞蹈和音樂表演',
        text:'歡迎來到「多元文化探索」主題週！我們將為您呈現多國文化的舞蹈和音樂表演，展示不同國家的藝術風格<br>表演時間：<span class="color1 fw">下午 3:30 - 下午5:30<span>',
        theme:'多元文化探索',
        date:'112/11/25(週六)'
    },
    '26':{
        img:'./images/body2/img8.png',
        title:'多國舞蹈和音樂表演',
        text:'歡迎來到「多元文化探索」主題週！我們將為您呈現多國文化的舞蹈和音樂表演，展示不同國家的藝術風格<br>表演時間：<span class="color1 fw">下午 4:00 - 下午6:00<span>（閉幕週的特別表演時段）',
        theme:'多元文化探索',
        date:'112/11/26(週日)'
    },

}

var body2_ck = '第一週'

var theme = '歷史之旅'

const body3_btn = ['特色攤位', '主題特色']
const body3_data = {
    '特色攤位': {
        '歷史之旅': [
            {
                img: './images/body3/img.png',
                title: '飾品創作工作坊活動',
                text: '慢播市集提供不同時代風格的飾品創作工作坊，包括古典、文藝復興和近代風格',
            },
            {
                img: './images/body3/img2.png',
                title: '街坊美食之旅',
                text: '慢播小幫手擔當導覽團，帶領您參觀城市的歷史區域，並品味傳統的街坊小吃，如古早味冰品和台中的老店糕餅',
            },
        ],
        '城市大自然': [
            {
                img: './images/body3/img3.png',
                title: '自然元素的飾品',
                text: '舉辦植物養护和飾品創作工作坊，參與者可以製作帶有自然元素的飾品，如樹葉耳環和花朵項鍊',
            },
            {
                img: './images/body3/img4.png',
                title: '戶外美食體驗',
                text: '安排戶外野餐活動，提供當季的自然食材，如野菜、水果和野生草本植物',
            },
        ],
        '街頭藝術之旅': [
            {
                img: './images/body3/img5.png',
                title: '藝術家市集攤位',
                text: '邀請街頭藝術家現場創作藝術作品，您可以觀看他們的創作過程，並購買喜愛的藝術品',
            },
            {
                img: './images/body3/img6.png',
                title: '街頭美食小吃',
                text: '呈現不同國家的街頭小吃，如西洋塔可、烤玉米、墨西哥捲餅等更有南洋風味特色咖哩與之較勁',
            },
        ],
        '多元文化探索': [
            {
                img: './images/body3/img7.png',
                title: '國際小吃日',
                text: '慢播多個小吃攤位，代表不同國家的美食，並結合音樂和舞蹈表演，打造多元文化體驗',
            },
            {
                img: './images/body3/img8.png',
                title: '多元文化飾品',
                text: '展示代表不同文化的飾品設計，並邀請當地藝術家解釋其文化背景和設計靈感',
            },
        ],
    },
    '主題特色': {
        '歷史之旅': [
            {
                img: './images/body3/img9.png',
                title: '近代風格飾品',
                text: '展示近代風格的飾品，如藝術裝飾風格或 20世紀初的藝術運動',
            },
            {
                img: './images/body3/img10.png',
                title: '歷史主題飾品',
                text: '創作以城市歷史事件、建築或人物為主題的飾品',
            },
            {
                img: './images/body3/img11.png',
                title: '傳統手工飾品',
                text: '展示古老的手工藝技巧，如琺瑯工藝、金屬鍛造、織布等',
            },
            {
                img: './images/body3/img12.png',
                title: '時代混搭風格',
                text: '創造一種混搭風格，將不同歷史時代的元素結合在一起，創作出獨特的風格',
            },
        ],
        '城市大自然': [
            {
                img: './images/body3/img13.png',
                title: '多肉植物養護工作坊',
                text: '舉辦多肉植物養護工作坊，向參與者提供如何照顧和種植多肉植物的實用技巧',
            },
            {
                img: './images/body3/img14.png',
                title: '多肉植物裝飾飾品',
                text: '展示多肉植物裝飾飾品，如多肉懸吊球、多肉筆筒等，並提供相關工作坊',
            },
        ],
        '街頭藝術之旅': [
            {
                img: './images/body3/img15.png',
                title: '跨文化塗鴉牆',
                text: '設立一個大型的塗鴉牆，供參與者發揮創意，創作屬於自己的街頭藝術作品',
            },
            {
                img: './images/body3/img16.png',
                title: '藝術家工作坊',
                text: '邀請當地街頭藝術家主持工作坊，教授塗鴉、塗鴉藝術技巧、塗鴉藝術史等',
            },
            {
                img: './images/body3/img17.png',
                title: '街頭音樂表演',
                text: '本週邀請街頭音樂家、樂隊以及 DJ 表演，為您提供現場音樂娛樂',
            },
            {
                img: './images/body3/img18.png',
                title: '藝術品販售',
                text: '提供藝術家的作品販售，讓您購買並收藏街頭藝術品',
            },
        ],
        '多元文化探索': [
            {
                img: './images/body3/img19.png',
                title: '性別平等區域',
                text: '這個區域我們專注於性別平等和多元性別議題',
            },
            {
                img: './images/body3/img20.png',
                title: '跨界藝術區域',
                text: '邀請跨界藝術家參與，展示融合不同藝術形式的作品，如視覺藝術、音樂、舞蹈和表演',
            },
            {
                img: './images/body3/img21.png',
                title: '社會企業和 NGO 展示',
                text: '提供一個展示社會企業和非政府組織（NGO）產品的區域',
            },
            {
                img: './images/body3/img22.png',
                title: '多元文化美食區域',
                text: '提供來自不同文化的美食和料理，包括素食選擇，讓您能品味世界各地的風味',
            },
        ],
    },
}
var body3_click = '特色攤位'

const body5_btn = ['高鐵','台鐵','公車','臺中I-bike鄰近站點','自行開車']

const body5_data = {
    '高鐵':'臺中新烏日高鐵站下車，搭乘接駁車或火車至臺中火車站，再<span class="fw color1 f5">轉搭公車至道禾六藝文化館</span>',
    '台鐵':'臺中火車站下車，可<span class="fw color1 f5">轉搭公車至道禾六藝文化館</span>',
    '公車':'統聯客運 1. 臺中刑務所演武場 – 中臺科技大學校區<br>\
            台中客運 8. 臺中刑務所演武場 – 逢甲大學(逢甲路)<br>\
            台中客運 15. 臺中刑務所演武場 – 國軍臺中總醫院<br>\
            中鹿客運 21. 臺中刑務所演武場 – 三貴城<br>\
            中鹿客運 21 延一 . 臺中刑務所演武場 – 民德橋<br>\
            中鹿客運 21 延二 . 臺中刑務所演武場 – 中興嶺<br>\
            豐原客運 55. 地方法院 – 豐原<br>\
            中鹿客運 525. 臺中刑務所演武場 – 社口<br>\
            <span class="fw color1 f5">公車 【道禾六藝文化館】下車</span><br>\
            台中客運 8. 臺中刑務所演武場 – 逢甲大學(逢甲路)<br>\
            台中客運 15. 臺中刑務所演武場 – 國軍臺中總醫院<br>\
            豐原客運 51. 莒光新城 – 圓山新村<br>\
            豐原客運 55. 地方法院 – 豐原<br>\
            台中客運 71. 臺中洲際棒球場 – 植物園(西屯路)<br>\
            統聯客運 75. 臺中榮總 – 一江橋<br>\
            豐原客運 202. 豐富公園 – 豐原(經樹德路)<br>\
            豐原客運 203. 豐富公園 – 豐原(經新田)<br>\
            豐原客運 270. 豐富公園 – 東勢(經大南)<br>\
            豐原客運 271. 豐富公園 – 東勢(經東興)<br>\
            豐原客運 276. 豐富公園 – 東勢(經興中山莊)<br>\
            豐原客運 277. 豐富公園 – 東勢(經復盛里)<br>\
            <span class="fw color1 f5">公車 【地方法院】下車，步行約五分鐘至道禾六藝文化館</span>',
    '臺中I-bike鄰近站點':'中山地政事務所-三民路一段/三民路一段 156 巷口<br>\
                        公館公園-三民路一段/自由路一段口<br>\
                        臺中女中-自由路一段/康樂街口<br>\
                        復興停車場-復興路三段/國光路口',
    '自行開車':'<span class="fw color1 f5">南下</span><br>\
    中山五權交流道>>五權西路>>五權路>>林森路>>府後街口(園區旁備有大型公有停車場)<br>\
    <span class="fw color1 f5">北上</span><br>\
    中港交流道>>台灣大道>>英才路>>林森路>>府後街口(園區旁備有大型公有停車場)',
}

var body5_btn_click = '高鐵'